Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.DataDomainEnum
The data domain.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.DataDomainEnum.Physical
The physical model.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.DataDomainEnum.Analysis
The analysis model.